{"title":"Are you more likely to need an umbrella in <span class=readerCity>New York</span> or Seattle?","intro":[{"type":"text","value":"If your first thought was, “Well, it’s constantly raining in Seattle”, you’re not alone. The city well-known for coffee shops and grunge music often conjures images of non-stop precipitation."},{"type":"text","value":"But as someone who has lived in Seattle for a few years now, this preconceived notion seems strange to me. In fact, I haven’t taken my umbrella outside once since I moved here. That’s not to say that it never rains here, but I did spend more days rain-soaked when I lived in Orlando, Florida; a city known for its sunshine."},{"type":"text","value":"In fact, let’s compare the amount of precipitation (rain and melted snow) that has fallen in both Orlando and Seattle over the course of 2019."}],"compare-nonSeattle":[{"step":"0","text":"It rained twice as much in Orlando as it did in Seattle. Now let’s add the weather station nearest to you (located at <span class=readerStation>XXX</span>)."},{"step":"1","text":"Looks like it rained <span class=readerCompare>more</span> in your area last year than in Seattle! We were able to find XXX weather stations across the US, its territories, and Canada that recorded precipitation every day for the past 10 years. Here are the 10 rainiest places in 2019, with Seattle and your location for comparison."},{"step":"2","text":"<span class=readerLoc>XXX</span> was ranked as the <span class=readerRank>XXX</span>th rainiest place in 2019, whereas Seattle was ranked the XXX. And just to dispell any feelings that 2019 was an unusually dry year for Seattle, let’s look at the rainiest places (on average) over the past 10 years."},{"step":"3","text":"Even with 10 years of data, Seattle isn’t even in the top 1000 rainiest places measured out of 2,800! So where does its rainy reputation come from?"}],"post-steps":"Let’s try answering this another way. Perhaps Seattle’s problem isn’t necessarily that it rains a lot of water, but just that it rains frequently. Here’s how the number of rainy days for Seattle and 10 other major cities in the US compare:","daily-cities":[{"city":"Seattle","id":"USW00094290"},{"city":"reader","id":"reader"},{"city":"Orlando","id":"USW00012815"},{"city":"Atlanta","id":"USW00013874"}]}